jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FICR</name>
      <description>Factory Information Configuration Registers</description>
      <groupName>FICR</groupName>
      <baseAddress>0xFF0000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPCONF00</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x8CC41077</resetValue>
          <fields>
            <field>
              <name>CKPUREEN</name>
              <description>Enable clock gate in clock purifier. Should always be 1.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PLL_CALIB_ROSC</name>
              <description>HFCLK ring oscillator trim codes. Previous name: HFROSCTRIM.</description>
              <lsb>7</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RC32KITRIM</name>
              <description>32.768 kHz RC-oscillator trim code</description>
              <lsb>13</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>BGREF</name>
              <description>Bandgap-reference trim code</description>
              <lsb>19</lsb>
              <msb>22</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF01</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0xF0DF769D</resetValue>
          <fields>
            <field>
              <name>LPBOR_N</name>
              <description>Enable low power BOR. Active low.</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SRAMWAITEN</name>
              <description>Enable wait on ready upon accessing SRAM when turned on</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>RCOSC32KICALLENGTH</name>
              <description>32kHz RC oscillator calibration length</description>
              <lsb>13</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF02</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x3211FFFF</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUPCNT</name>
              <description>Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>IFCREADDELAY</name>
              <description>number of cycles before Information Configuration Registers can be read</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WS16MHz</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access (HFCLOCK = 16 MHz), D-Code has one more wait-state.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS32MHz</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access (HFCLOCK = 32 MHz). D-Code has one more wait-state.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS64MHz</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access (HFCLOCK = 64 MHz). D-Code has one more wait-state.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS96MHz</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access (HFCLOCK = 96 MHz). D-Code has one more wait-state.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF03</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x6464FFFF</resetValue>
          <fields>
            <field>
              <name>THRESHOLDREG1</name>
              <description>Sets the threshold value of power regulator (default value for POWER-&amp;gt;THRESHOLDREG1)</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>THRESHOLDREG2</name>
              <description>Sets the threshold value of power regulator (default value for POWER-&amp;gt;THRESHOLDREG2)</description>
              <lsb>24</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF04</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFF7FFFE6</resetValue>
          <fields>
            <field>
              <name>RCOSC32KIULPTRIM</name>
              <description>32.678 kHz ULP RC oscillator trim code</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>COMPREFTRIM</name>
              <description>Calibrate internal bandgap reference in COMP</description>
              <lsb>9</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>RCOSC32KIULPCALLENGTH</name>
              <description>32kHz ULP RC oscillator calibration length</description>
              <lsb>21</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>USBPLL_CALIB_ROSC</name>
              <description>USB 48 MHz ring oscillator trim codes.</description>
              <lsb>26</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF05</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00011FAF</resetValue>
          <fields>
            <field>
              <name>BUCK_AVDD_CAL</name>
              <description>BUCK AVDD output voltage calibration</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>BUCK_AVDD_CKSEL</name>
              <description>BUCK AVDD Input clock selection.</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>normal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>inverted clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCK_AVDD_VOLTAGE</name>
              <description>Output voltage selection.</description>
              <lsb>7</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V00</name>
                  <description>1.00 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V09</name>
                  <description>1.09 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V17</name>
                  <description>1.17 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V26</name>
                  <description>1.26 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCK_DVDD_CAL</name>
              <description>BUCK DVDD output voltage calibration</description>
              <lsb>9</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>BUCK_DVDD_CKSEL</name>
              <description>BUCK DVDD Input clock selection.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>normal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>inverted clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCK_DVDD_VOLTAGE</name>
              <description>BUCK_DVDD Output voltage selection.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V00</name>
                  <description>1.00 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V09</name>
                  <description>1.09 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V17</name>
                  <description>1.17 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V26</name>
                  <description>1.26 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREG_AVDD_TRIM</name>
              <description>VREG AVDD Output voltage calibration</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>default voltage</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREG_DVDD_HIGH</name>
              <description>Enable or disable the feature</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Nominal output levels of VREG_DVDD LDO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Increased output levels of VREG_DVDD LDO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREG_DVDD_TRIM</name>
              <description>VREG DVDD Output voltage calibration</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>default voltage</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF06</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001480</resetValue>
          <fields>
            <field>
              <name>VREG_ULP_AVDD_TRIM</name>
              <description>VREG ULP AVDD Output voltage calibration</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>min voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>max voltage</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREG_ULP_DVDD_HIGH</name>
              <description>Enable or disable the feature</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Nominal output levels of VREG_ULP_DVDD LDO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Increased output levels of VREG_ULP_DVDD LDO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREG_ULP_DVDD_TRIM</name>
              <description>VREG ULP DVDD Output voltage calibration</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>min voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>max voltage</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_REGULATOR_CK_FORCE</name>
              <description>Disable Regulator to Force Clock</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Power regulator control requests clock automatically when it needs it (normal mode)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>Power regulator control requests clock constantly (backdoor)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNORE_ANA_READY_SIGNALS</name>
              <description>Ignore Reday Signal from Analog part</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Power regulator control waits for analog ready signals (normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>Power regulator control does not wait for analog ready signals (backdoor)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGUSB_CFG</name>
              <description>VREG USB Configuration</description>
              <lsb>9</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>VREGUSB_TRIM</name>
              <description>VREG USB Output voltage calibration</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>min voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>max voltage</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP0</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP0</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP1</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x0F4</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP1</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP2</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x0F8</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP2</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP3</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x0FC</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP3</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
