jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>RAM</name>
          <description>RAM variant</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>RAM</name>
              <description>RAM variant</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K16</name>
                  <description>16 kByte RAM</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K32</name>
                  <description>32 kByte RAM</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K64</name>
                  <description>64 kByte RAM</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unspecified</name>
                  <description>Unspecified</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH</name>
          <description>Flash variant</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000400</resetValue>
          <fields>
            <field>
              <name>FLASH</name>
              <description>Flash variant</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K128</name>
                  <description>128 kByte FLASH</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K256</name>
                  <description>256 kByte FLASH</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K512</name>
                  <description>512 kByte FLASH</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K1024</name>
                  <description>1 MByte FLASH</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unspecified</name>
                  <description>Unspecified</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTSTATUS</name>
          <description>Code memory test status. Will be set during production test.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <alternateRegister>RAM</alternateRegister>
          <fields>
            <field>
              <name>TESTSTATUS</name>
              <description>Code memory test status. Will be set during production test.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST0</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <alternateRegister>FLASH</alternateRegister>
          <fields>
            <field>
              <name>CP1</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST00</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x108</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CP1</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST1</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID1</name>
              <description>1st ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID2</name>
              <description>2nd ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>LOTID3</name>
              <description>3rd ascii byte of Lot ID character</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>LOTID4</name>
              <description>4th ascii byte of Lot ID character</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST2</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x110</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID5</name>
              <description>5th ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID6</name>
              <description>6th ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WAFER</name>
              <description>Wafer number, 1 byte integer</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>XCOORD</name>
              <description>Device X-coordinate, always &amp;gt;=0, offset so that the leftmost value on wafer is 0</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST3</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>YCOORD</name>
              <description>Device Y-coordinate, always &amp;gt;=0, offset so that the bottom value on wafer is 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DR1</name>
              <description>Data Retention (DR) flag</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DR2</name>
              <description>Data Retention (DR) flag</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DR3</name>
              <description>Data Retention (DR) flag</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST4</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x118</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR4</name>
              <description>Data Retention (DR) flag</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST5</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST5</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST6</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST6</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST7</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST7</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST8</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x128</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST8</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FWID</name>
                <description>Deprecated field -  Identification number for the FW that is pre-loaded into the chip</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-1</dimIndex>
            <name>DEVICEID[%s]</name>
            <description>Description collection[0]:  Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00091200</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x41414142</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000040</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K16</name>
                    <description>16 kByte RAM</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K32</name>
                    <description>32 kByte RAM</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K64</name>
                    <description>64 kByte RAM</description>
                    <value>0x40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000400</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K128</name>
                    <description>128 kByte FLASH</description>
                    <value>0x80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte FLASH</description>
                    <value>0x100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K512</name>
                    <description>512 kByte FLASH</description>
                    <value>0x200</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K1024</name>
                    <description>1 MByte FLASH</description>
                    <value>0x400</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x0000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>0-31</dimIndex>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster[0]:  Address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster[0]:  Data</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Data</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
