jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM7</name>
                <description>Priority register for RAM AHB slave 7</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCNF</name>
      <description>Domain Configuration Management</description>
      <groupName>DCNF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <alternatePeripheral>PMU_REGULATORS</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CPUID</name>
          <description>CPU number in the system</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPUID</name>
              <description>CPU number in the system</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>EXTPERI0</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI0</headerStructName>
          <addressOffset>0x440</addressOffset>
          <register>
            <dim>3</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-2</dimIndex>
            <name>PROTECT[%s]</name>
            <description>Description collection[0]:  Control access for  Master connected to AMLI master port EXTPERI[0]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTPERI[0].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTPERI[0].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTPERI[0].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave  3 of master EXTPERI[0].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave  4 of master EXTPERI[0].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave  5 of master EXTPERI[0].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave  6 of master EXTPERI[0].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE7</name>
                <description>Control access to slave  7 of master EXTPERI[0].</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>5</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-4</dimIndex>
          <name>EXTPERI1[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI1</headerStructName>
          <addressOffset>0x44C</addressOffset>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>EXTRAM</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTRAM</headerStructName>
          <addressOffset>0x460</addressOffset>
          <register>
            <dim>3</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-2</dimIndex>
            <name>PROTECT[%s]</name>
            <description>Description collection[0]:  Control access from  Master connected to AMLI master port EXTRAM[0]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTRAM[0].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTRAM[0].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTRAM[0].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave  3 of master EXTRAM[0].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave  4 of master EXTRAM[0].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave  5 of master EXTRAM[0].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave  6 of master EXTRAM[0].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE7</name>
                <description>Control access to slave  7 of master EXTRAM[0].</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>5</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-4</dimIndex>
          <name>EXTPERI2[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI2</headerStructName>
          <addressOffset>0x46C</addressOffset>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
