jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <cluster>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EXTCODE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTCODE</headerStructName>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster[0]:  Control access from  Master connected to AMLI master port EXTCODE[0]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTCODE[0].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTCODE[0].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTCODE[0].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave  3 of master EXTCODE[0].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave  4 of master EXTCODE[0].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave  5 of master EXTCODE[0].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave  6 of master EXTCODE[0].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE7</name>
                <description>Control access to slave  7 of master EXTCODE[0].</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>EXTPERI3[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI3</headerStructName>
          <addressOffset>0x488</addressOffset>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
