jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MWU</name>
      <description>Memory Watch Unit</description>
      <groupName>MWU</groupName>
      <baseAddress>0x40001000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MWU</name>
        <value>1</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>EVENTS_REGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MWU_EVENTS_REGION</headerStructName>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster[0]:  Write access to region 0 detected</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster[0]:  Read access to region 0 detected</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EVENTS_PREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MWU_EVENTS_PREGION</headerStructName>
          <addressOffset>0x160</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster[0]:  Write access to peripheral region 0 detected</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster[0]:  Read access to peripheral region 0 detected</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>PUBLISH_REGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MWU_PUBLISH_REGION</headerStructName>
          <addressOffset>0x180</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster[0]:  Publish configuration for EVENTS_REGION[0].WA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel the EVENTS_REGION[0].WA will subscribe to.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable publishing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable publishing</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster[0]:  Publish configuration for EVENTS_REGION[0].RA</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel the EVENTS_REGION[0].RA will subscribe to.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable publishing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable publishing</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>8</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PUBLISH_PREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MWU_PUBLISH_PREGION</headerStructName>
          <addressOffset>0x1E0</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster[0]:  Publish configuration for EVENTS_PREGION[0].WA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel the EVENTS_PREGION[0].WA will subscribe to.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable publishing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable publishing</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster[0]:  Publish configuration for EVENTS_PREGION[0].RA</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel the EVENTS_PREGION[0].RA will subscribe to.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable publishing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable publishing</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>REGION0WA</name>
              <description>Enable or disable interrupt for REGION[0].WA event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION0RA</name>
              <description>Enable or disable interrupt for REGION[0].RA event</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION1WA</name>
              <description>Enable or disable interrupt for REGION[1].WA event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION1RA</name>
              <description>Enable or disable interrupt for REGION[1].RA event</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION2WA</name>
              <description>Enable or disable interrupt for REGION[2].WA event</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION2RA</name>
              <description>Enable or disable interrupt for REGION[2].RA event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION3WA</name>
              <description>Enable or disable interrupt for REGION[3].WA event</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION3RA</name>
              <description>Enable or disable interrupt for REGION[3].RA event</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION0WA</name>
              <description>Enable or disable interrupt for PREGION[0].WA event</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION0RA</name>
              <description>Enable or disable interrupt for PREGION[0].RA event</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION1WA</name>
              <description>Enable or disable interrupt for PREGION[1].WA event</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION1RA</name>
              <description>Enable or disable interrupt for PREGION[1].RA event</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
