jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REGULATORS</name>
      <description>Voltage Regulators control</description>
      <groupName>REGULATORS</groupName>
      <baseAddress>0x40003000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DISABLEHPBOR</name>
          <description>Enable or disable HPBOR</description>
          <addressOffset>0x434</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable HPBOR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable HPBOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HPBOR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNUSED0</name>
          <description>Unspecified</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power failure comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power failure comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power failure comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V17</name>
                  <description>Set threshold to 1.7 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V18</name>
                  <description>Set threshold to 1.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTDIS</name>
              <description>Bypass power failure comparator hysteresis</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Hysteresis active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoHyst</name>
                  <description>Hysteresis disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOFFNVM</name>
          <description>Force off NVM supply. See also the internal section in the NVMC chapter.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEOFFNVM</name>
              <description>Force off NVM supply. See also the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Read: Do not force off NVM supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Read: Force off NVM supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>DisableForceOff</name>
                  <description>Write: Do not force off NVM supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableForceOff</name>
                  <description>Write: Force off NVM supply.</description>
                  <value>0xBADCA81E</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCEN</name>
          <description>DC/DC enable register for REG1 (DVDD_0V9).</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable or disable DC/DC converter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCEN2</name>
          <description>DC/DC enable register for REG2 (AVDD_1V3)</description>
          <addressOffset>0x57C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable or disable DC/DC mode.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCENMIR</name>
          <description>Enable mirroring of DCDCEN register into DCDCEN2 register.</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCENMIR</name>
              <description>Enable or disable mirroring of DCDCEN register into DCDCEN2 register.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DCDCEN and DCDCEN2 can be set independently</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DCDCEN2 is a mirrored version of DCDCEN register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ATEPOWER</name>
          <description>Analog test bus control for power modules</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PDCLAMP</name>
              <description>Enable or disable power-down clamp on analog test bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVCLAMP</name>
              <description>Enable or disable overvoltage clamp on analog test bus</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDD1V3</name>
              <description>Connect or disconnect AVDD_1V3 to analog test bus</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVDD0V9</name>
              <description>Connect or disconnect DVDD_0V9 to analog test bus</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVSS</name>
              <description>Connect or disconnect AVSS to analog test bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBIAS</name>
              <description>Configure connection of master bias generator to analog test bus</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBG</name>
                  <description>Connect 0.9 V bandgap voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBPSR10U</name>
                  <description>Connect 10 uA IBPSR current to ATB1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Connect both VBG to ATB0 and IBPSR10U to ATB1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFNVM</name>
              <description>Connect or disconnect reference generator for flash to analog test bus</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect 0.9 V downscaled reference voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCCONFREG1</name>
          <description>Configuration register for REG1 DCDC regulator (DVDD_0V9).</description>
          <addressOffset>0x5D0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUCK_CAL</name>
              <description>Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>BUCK_VOLTAGE</name>
              <description>Output voltage selection.</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V00</name>
                  <description>1.00 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V09</name>
                  <description>1.09 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V17</name>
                  <description>1.17 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V26</name>
                  <description>1.26 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCK_CKSEL</name>
              <description>Input clock selection.</description>
              <lsb>7</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>normal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>inverted clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCCONFREG2</name>
          <description>Configuration register for REG2 DCDC regulator (AVDD_1V3).</description>
          <addressOffset>0x5D4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUCK_CAL</name>
              <description>Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>BUCK_VOLTAGE</name>
              <description>Output voltage selection.</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V00</name>
                  <description>1.00 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V09</name>
                  <description>1.09 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V17</name>
                  <description>1.17 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V26</name>
                  <description>1.26 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCK_CKSEL</name>
              <description>Input clock selection.</description>
              <lsb>7</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>normal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>inverted clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNUSED1</name>
          <description>Unspecified</description>
          <addressOffset>0xA08</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UNUSED2</name>
          <description>Unspecified</description>
          <addressOffset>0xA0C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>FORCEMODEREG1</name>
          <description>A backdoor register for manual selection of REG1 regulator mode (DVDD_0V9)</description>
          <addressOffset>0xA10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEMODE</name>
              <description>Force Regulator Power Mode</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Force external (DVDD_0V9 supplied externally)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>Force ULP mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Force LDO mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>Force DCDC mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH</name>
                  <description>Force DCDC REFRESH mode</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
