jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>THRESHOLDREG1</name>
          <description>Set threshold value of REG1 DCDC regulator</description>
          <addressOffset>0xA20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>Sets the threshold value of power regulator. Note: The reset value comes from FICR (see FICR chapter for details)</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENFORCEMODEREG1</name>
          <description>Enable forcing of power mode in REG1 voltage regulator</description>
          <addressOffset>0xA24</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENFORCEMODE</name>
              <description>Enable forcing of power mode in voltage regulator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Regulator mode forcing OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Regulator forced ON in a power mode given by FORCEREGMODE1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IGNOREDAPCMODE</name>
          <description>Ignore DAPCP power mode</description>
          <addressOffset>0xA28</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>IGNOREDAPCMODE</name>
              <description>Ignore power request from debugger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Do not ignore</name>
                  <description>Do not ignore power request form debugger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore power request from debugger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CURRENTMODEREG1</name>
          <description>Currently used power mode of the REG1 voltage regulator</description>
          <addressOffset>0xA2C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CURRENTMODE</name>
              <description>Currently used mode of the voltage regulator</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Externally supplied DVDD_0V9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>DCDC mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH</name>
                  <description>DCDC REFRESH mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>LDO mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_DCDC</name>
                  <description>swithching between LDO and DCDC (in any direction) Intermediate state when both regulators are ON</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_DCDC_REFRESH</name>
                  <description>swithching between LDO and DCDC-REFRESH (in any direction) Intermediate state when both regulators are ON</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>ULP mode</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP</name>
                  <description>swithching from DCDC to ULP Intermediate state when both regulators are ON</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH_ULP</name>
                  <description>swithching from DCDC-REFRESH to ULP Intermediate state when both regulators are ON</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP_LDO</name>
                  <description>swithching between ULP and LDO (in any direction) Intermediate state when both regulators are ON</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEMODEREG2</name>
          <description>A backdoor register for manual selection of REG2 regulator mode (DVDD_1V3)</description>
          <addressOffset>0xA30</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEMODE</name>
              <description>Force Regulator Power Mode</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Force external (AVDD_1V3 supplied externally)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>Force ULP mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Force LDO mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>Force DCDC mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH</name>
                  <description>Force DCDC REFRESH mode</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>THRESHOLDREG2</name>
          <description>Set threshold value of REG2 DCDC regulator</description>
          <addressOffset>0xA38</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>Sets the threshold value of power regulator. Note: The reset value comes from FICR (see FICR chapter for details)</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENFORCEMODEREG2</name>
          <description>Enable forcing of power mode in REG2 voltage regulator</description>
          <addressOffset>0xA3C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENFORCEMODE</name>
              <description>Enable forcing of power mode in voltage regulator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Regulator mode forcing OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Regulator forced ON in a power mode given by FORCEREGMODE2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLEHSLIMITREG2</name>
          <description>Disable HSLIMIT for REG2 DCDC regulator</description>
          <addressOffset>0xA40</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable HSLIMIT for DCDC regulator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable HSLIMIT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HSLIMIT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CURRENTMODEREG2</name>
          <description>Currently used power mode of the REG2 voltage regulator</description>
          <addressOffset>0xA44</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CURRENTMODE</name>
              <description>Currently used mode of the voltage regulator</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Externally supplied AVDD_1V3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>DCDC mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH</name>
                  <description>DCDC REFRESH mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>LDO mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_DCDC</name>
                  <description>swithching between LDO and DCDC (in any direction) Intermediate state when both regulators are ON</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_DCDC_REFRESH</name>
                  <description>swithching between LDO and DCDC-REFRESH (in any direction) Intermediate state when both regulators are ON</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>ULP mode</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP</name>
                  <description>swithching from DCDC to ULP Intermediate state when both regulators are ON</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_REFRESH_ULP</name>
                  <description>swithching from DCDC-REFRESH to ULP Intermediate state when both regulators are ON</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP_LDO</name>
                  <description>swithching between ULP and LDO (in any direction) Intermediate state when both regulators are ON</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLEHSLIMITREG1</name>
          <description>Disable HSLIMIT for REG1 DCDC regulator</description>
          <addressOffset>0xA48</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable HSLIMIT for DCDC regulator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable HSLIMIT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HSLIMIT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOCONFREG1</name>
          <description>Configuration register for REG1 LDO regulator (DVDD_0V9).</description>
          <addressOffset>0xA54</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VREGTRIM</name>
              <description>Output voltage calibration.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>011</name>
                  <description>1.163 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>1.136 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>1.108 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000</name>
                  <description>1.082 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.054 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.029 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.003 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>0.980 V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOTESTLOADREG1</name>
          <description>Test load setting for REG1 LDO regulator (DVDD_0V9).</description>
          <addressOffset>0xA58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREGLOAD</name>
              <description>Output load configuration (for test purposes)</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal operation</name>
                  <description>Normal operation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1mA test load</name>
                  <description>1mA test load</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50mA test load</name>
                  <description>50mA test load</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>150mA test load</name>
                  <description>150mA test load</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOCONFREG2</name>
          <description>Configuration register for REG2 LDO regulator (AVDD_1V3).</description>
          <addressOffset>0xA5C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VREGTRIM</name>
              <description>Output voltage calibration.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>011</name>
                  <description>1.357 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>1.324 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>1.289 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000</name>
                  <description>1.255 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.219 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.185 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.150 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>0.117 V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOTESTLOADREG2</name>
          <description>Test load setting for REG2 LDO regulator (AVDD_1V3).</description>
          <addressOffset>0xA60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREGLOAD</name>
              <description>Output load configuration (for test purposes)</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal operation</name>
                  <description>Normal operation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1mA test load</name>
                  <description>1mA test load</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50mA test load</name>
                  <description>50mA test load</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>150mA test load</name>
                  <description>150mA test load</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ULPCONFREG1</name>
          <description>Configuration register for REG1 ULP regulator (DVDD_0V9).</description>
          <addressOffset>0xA64</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ULPTRIM</name>
              <description>Output voltage calibration. 0: minimum voltage 7: maximum voltage</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ULPCONFREG2</name>
          <description>Configuration register for REG2 ULP regulator (AVDD_1V3).</description>
          <addressOffset>0xA68</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ULPTRIM</name>
              <description>Output voltage calibration. 0: minimum voltage 7: maximum voltage</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VREG_HIGH_REG1</name>
          <description>Increase voltage to AVDD_1V3 levels for REG1 LDO regulator (DVDD_0V9)</description>
          <addressOffset>0xA6C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the feature</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Nominal output levels of REG1 LDO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Increased output levels of REG1 LDO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
