jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>ULP_HIGH_REG1</name>
          <description>Increase voltage to AVDD_1V3 ULP levels for REG1 ULP regulator (DVDD_0V9)</description>
          <addressOffset>0xA70</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the feature</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Nominal output levels of REG1 ULP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Increased output levels of REG1 ULP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLESRAMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from SRAM</description>
          <addressOffset>0xEE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from SRAM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLENVMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from NVM</description>
          <addressOffset>0xEEC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from NVM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OSCILLATORS</name>
      <description>Oscillators control</description>
      <groupName>OSCILLATORS</groupName>
      <baseAddress>0x40003000</baseAddress>
      <size>32</size>
      <alternatePeripheral>REGULATORS</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ATECLOCK</name>
          <description>Analog test bus control for clock modules</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL</name>
              <description>Configure connection of PLL to analog test bus</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC</name>
                  <description>Connect loop filter voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Osc32MDiv</name>
                  <description>Connect 32 MHz divided clock to ATB1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Connect both VC and Osc32MDiv</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32MACCPL</name>
          <description>HFXO bypass mode selection.</description>
          <addressOffset>0x5C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XOSC32MACCPL</name>
              <description>HFXO bypass mode selection.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal_bypass_mode</name>
                  <description>3V square wave on XC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC_coupled_bypass_mode</name>
                  <description>Ac-coupled clipped sine on XC1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASS32KI</name>
          <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable (use with Xtal or low-swing external source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable (use with rail-to-rail external source)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POWERDOWN32KI</name>
          <description>Enable/Disable forced power power down of LFXO</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POWERDOWN32KI</name>
              <description>Enable/Disable forced power power down of LFXO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisableForcedOFF</name>
                  <description>LFXO can be enabled if requested</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableForcedOFF</name>
                  <description>LFXO cannot be enabled when requested</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFQSTRT</name>
          <description>TBD</description>
          <addressOffset>0x608</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFQSTRT</name>
              <description>TBD</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNUSED0</name>
          <description>Unspecified</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HFCTRL</name>
          <description>Temporary for CLOCK HFCTRL</description>
          <addressOffset>0x610</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFCTRL</name>
              <description>TBD</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASS32M</name>
          <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
          <addressOffset>0x614</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable (use with Xtal or low-swing external source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable (use with rail-to-rail external source)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32MCTRL</name>
          <description>Reserved for future use</description>
          <addressOffset>0x618</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>XOSC32MCTRL</name>
              <description>Reserved for future use</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BBDLL</name>
          <description>BBDLL override register in case BBDLL does not behave as expected</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Control BBDLL clock output</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>BBDLL is operating normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>BBDLL output clock is replaced by HFCLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEINLOCK</name>
              <description>Control BBDLL Lock behaviour</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>BBDLL Lock signal is provided directly by the BBDLL oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>BBDLL Lock signal is always forced to one</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUTE</name>
              <description>Turn on or off the BBDLL clock output</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>False</name>
                  <description>BBDLL clock is not muted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>True</name>
                  <description>BBDLL clock is muted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTBYPASS</name>
              <description>Enable or Disable bypass of BBDLL clock with an external clock provided on GPIO29</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>BBDLL is operating normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>BBDLL output clock is replaced by an external clock provided at GPIO29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare control signal for BBDLL</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
