jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>HFCLKCURRFREQ</name>
          <description>Current frequency of HFCLK</description>
          <addressOffset>0x430</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HFCLKCURRFREQ</name>
              <description>Current High frequency clock (HCLK) frequency</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64M</name>
                  <description>64 MHz (default frequency)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32M</name>
                  <description>32 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>16 MHz</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLKSRC</name>
          <description>Clock source for the HFCLK oscillator, and configuration of XTAL oscillator. This register shall only be written while no oscillation is present on XC1. Failing to do so may cause unexpected behaviour.</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00100001</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>Select which HFCLK source is started by the START task</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFINT</name>
                  <description>HFCLKSTART task starts HFINT oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFCLKSTART task starts HFXO oscillator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKSRC</name>
          <description>Clock source for the LFCLK. LFCLKSTART task starts starts a clock source selected with this register. LFULP is not treat as a separate clock source on Alta MLM1, where default clock source (0) is LFRC.</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Clock source</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFULP</name>
                  <description>32.768 kHz ultra low power RC oscillator (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>32.768 kHz RC oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>32.768 kHz crystal oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFSYNT</name>
                  <description>32.768 kHz synthesized from HFCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLKCTRL</name>
          <description>HFCLK frequency configuration. The feature is not implemented on Alta MLM1. Specification of this feature is under discussion. See SAMPO-2263.</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HCLK</name>
              <description>High frequency clock HCLK</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64M</name>
                  <description>64 MHz</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32M</name>
                  <description>32 MHz</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>16 MHz</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACECONFIG</name>
          <description>Clocking options for the Trace Port debug interface</description>
          <addressOffset>0x55C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRACEPORTSPEED</name>
              <description>Speed of Trace Port clock. Note that the TRACECLK pin will output this clock divided by two.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32 MHz Trace Port clock (TRACECLK = 16 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16 MHz Trace Port clock (TRACECLK = 8 MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MHz</name>
                  <description>8 MHz Trace Port clock (TRACECLK = 4 MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MHz</name>
                  <description>4 MHz Trace Port clock (TRACECLK = 2 MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACEMUX</name>
              <description>Pin multiplexing of trace signals.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIOs multiplexed onto all trace-pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Serial</name>
                  <description>SWO multiplexed onto P0.18, GPIO multiplexed onto other trace pins</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Parallel</name>
                  <description>TRACECLK and TRACEDATA multiplexed onto P0.20, P0.18, P0.16, P0.15 and P0.14.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
