jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <cluster>
          <name>LTEMODEM</name>
          <description>LTE Modem</description>
          <headerStructName>POWER_LTEMODEM</headerStructName>
          <addressOffset>0x610</addressOffset>
          <register>
            <name>RESET</name>
            <description>Reset LTE modem</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>RESET</name>
                <description>CPU soft reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release CPU reset signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold CPU reset signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEOFF</name>
            <description>Force off power and clock in LTE modem</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>FORCEOFF</name>
                <description>Force off power and clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force off signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force off signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEON</name>
            <description>Force on LTE modem</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEON</name>
                <description>Forces an power and clock in LTE modem</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force on signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force on signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>PAMLI</name>
      <description>Peripheral AHB Multi-Layer Interface</description>
      <groupName>PAMLI</groupName>
      <baseAddress>0x40007000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BRIDGETYPE</name>
          <description>Select AHB2AHB Sync Bridge Type</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>RADIO</name>
              <description>Select bridge type for RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Select standard ARM bridge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nordic</name>
                  <description>Select Nordic bridge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTO</name>
              <description>Select bridge type for CCM, ECB, AAR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Select standard ARM bridge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nordic</name>
                  <description>Select Nordic bridge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RAMPRI</name>
          <description>RAM configurable priority configuration structure</description>
          <headerStructName>PAMLI_RAMPRI</headerStructName>
          <addressOffset>0xE00</addressOffset>
          <register>
            <name>SPIS1</name>
            <description>AHB bus master priority register for SPIM1, SPIS1, TWIM1 and TWIS1</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM2</name>
                <description>Priority register for RAM AHB slave 2</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM3</name>
                <description>Priority register for RAM AHB slave 3</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM4</name>
                <description>Priority register for RAM AHB slave 4</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM5</name>
