jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM6</name>
                <description>Priority register for RAM AHB slave 6</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM7</name>
                <description>Priority register for RAM AHB slave 7</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri8</name>
                    <description>Priority 8</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri9</name>
                    <description>Priority 9</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri10</name>
                    <description>Priority 10</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri11</name>
                    <description>Priority 11</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri12</name>
                    <description>Priority 12</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri13</name>
                    <description>Priority 13</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri14</name>
                    <description>Priority 14</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri15</name>
                    <description>Priority 15</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
