jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>INPUTMODE</name>
          <description>Input mode</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INPUTMODE</name>
              <description>Input mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Analog</name>
                  <description>Analog filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Digital</name>
                  <description>Digital filtering</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No filtering</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGENABLE</name>
          <description>Enable TWIS debug features (PINSTATUS register)</description>
          <addressOffset>0x5A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable TWIS</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable TWIS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable TWIS debug features</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ORC</name>
          <description>Over-read character. Character sent out in case of an over-read of the transmit buffer.</description>
          <addressOffset>0x5C0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ORC</name>
              <description>Over-read character. Character sent out in case of an over-read of the transmit buffer.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UARTE0">
      <name>UARTE1</name>
      <description>UART with EasyDMA 1</description>
      <groupName>UARTE</groupName>
      <baseAddress>0x40009000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0">
      <name>SPIM1</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <groupName>SPIM</groupName>
      <baseAddress>0x40009000</baseAddress>
      <size>32</size>
      <alternatePeripheral>UARTE1</alternatePeripheral>
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0">
      <name>SPIS1</name>
      <description>SPI Slave 1</description>
      <groupName>SPIS</groupName>
      <baseAddress>0x40009000</baseAddress>
      <size>32</size>
      <alternatePeripheral>UARTE1</alternatePeripheral>
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIM0">
      <name>TWIM1</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <groupName>TWIM</groupName>
      <baseAddress>0x40009000</baseAddress>
      <size>32</size>
      <alternatePeripheral>UARTE1</alternatePeripheral>
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIS0">
      <name>TWIS1</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <groupName>TWIS</groupName>
      <baseAddress>0x40009000</baseAddress>
      <size>32</size>
      <alternatePeripheral>UARTE1</alternatePeripheral>
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIOTE</name>
      <description>GPIO Tasks and Events</description>
      <groupName>GPIOTE</groupName>
      <baseAddress>0x4000A000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIOTE</name>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>TASKS_OUT[%s]</name>
          <description>Description collection[0]:  Task for writing to pin specified in CONFIG[0].PSEL. Action on pin is configured in CONFIG[0].POLARITY.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>TASKS_SET[%s]</name>
          <description>Description collection[0]:  Task for writing to pin specified in CONFIG[0].PSEL. Action on pin is to set it high.</description>
          <addressOffset>0x030</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>TASKS_CLR[%s]</name>
          <description>Description collection[0]:  Task for writing to pin specified in CONFIG[0].PSEL. Action on pin is to set it low.</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SUBSCRIBE_OUT[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_OUT[0]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_OUT[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SUBSCRIBE_SET[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_SET[0]</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_SET[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SUBSCRIBE_CLR[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_CLR[0]</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_CLR[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>EVENTS_IN[%s]</name>
          <description>Description collection[0]:  Event generated from pin specified in CONFIG[0].PSEL</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_PORT</name>
          <description>Event generated from multiple input GPIO pins with SENSE mechanism enabled</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>PUBLISH_IN[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_IN[0]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_IN[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PORT</name>
          <description>Publish configuration for EVENTS_PORT</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_PORT will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN0</name>
              <description>Enable or disable interrupt for IN[0] event</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN1</name>
              <description>Enable or disable interrupt for IN[1] event</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN2</name>
              <description>Enable or disable interrupt for IN[2] event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN3</name>
              <description>Enable or disable interrupt for IN[3] event</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN4</name>
              <description>Enable or disable interrupt for IN[4] event</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN5</name>
              <description>Enable or disable interrupt for IN[5] event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN6</name>
              <description>Enable or disable interrupt for IN[6] event</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN7</name>
              <description>Enable or disable interrupt for IN[7] event</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT</name>
              <description>Enable or disable interrupt for PORT event</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
