jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>ENABLE</name>
          <description>Enable or disable ADC</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable ADC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ADC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SAADC_CH</headerStructName>
          <addressOffset>0x510</addressOffset>
          <register>
            <name>PSELP</name>
            <description>Description cluster[0]:  Input positive pin selection for CH[0]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PSELP</name>
                <description>Analog positive input channel</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput0</name>
                    <description>AIN0</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput1</name>
                    <description>AIN1</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput2</name>
                    <description>AIN2</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput3</name>
                    <description>AIN3</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput4</name>
                    <description>AIN4</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput5</name>
                    <description>AIN5</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput6</name>
                    <description>AIN6</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput7</name>
                    <description>AIN7</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDD</name>
                    <description>VDD</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB0</name>
                    <description>ATB0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB2</name>
                    <description>ATB2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB3</name>
                    <description>ATB3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVDD1V3</name>
                    <description>AVDD1V3</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DVDD0V9</name>
                    <description>DVDD0V9</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference</description>
                    <value>0x10</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PSELN</name>
            <description>Description cluster[0]:  Input negative pin selection for CH[0]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PSELN</name>
                <description>Analog negative input, enables differential channel</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput0</name>
                    <description>AIN0</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput1</name>
                    <description>AIN1</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput2</name>
                    <description>AIN2</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput3</name>
                    <description>AIN3</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput4</name>
                    <description>AIN4</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput5</name>
                    <description>AIN5</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput6</name>
                    <description>AIN6</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput7</name>
                    <description>AIN7</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDD</name>
                    <description>VDD</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB0</name>
                    <description>ATB0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB2</name>
                    <description>ATB2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB3</name>
                    <description>ATB3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVDD1V3</name>
                    <description>AVDD1V3</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DVDD0V9</name>
                    <description>DVDD0V9</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference</description>
                    <value>0x10</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster[0]:  Input configuration for CH[0]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <fields>
              <field>
                <name>RESP</name>
                <description>Positive channel resistor control</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass resistor ladder</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pulldown</name>
                    <description>Pull-down to GND</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pullup</name>
                    <description>Pull-up to VDD</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDD1_2</name>
                    <description>Set input at VDD/2</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESN</name>
                <description>Negative channel resistor control</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass resistor ladder</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pulldown</name>
                    <description>Pull-down to GND</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pullup</name>
                    <description>Pull-up to VDD</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDD1_2</name>
                    <description>Set input at VDD/2</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GAIN</name>
                <description>Gain control</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Gain1_6</name>
                    <description>1/6</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1_5</name>
                    <description>1/5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1_4</name>
                    <description>1/4</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1_3</name>
                    <description>1/3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1_2</name>
                    <description>1/2</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1</name>
                    <description>1</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain2</name>
                    <description>2</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain4</name>
                    <description>4</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REFSEL</name>
                <description>Reference control</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Internal reference (0.6 V)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDD1_4</name>
                    <description>VDD/4 as reference</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PADCIN1_4</name>
                    <description>PADC_IN/4 as reference</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB0</name>
                    <description>ATB0 as reference</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1 as reference</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MBIAS</name>
                    <description>MBIAS as reference</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TACQ</name>
                <description>Acquisition time, the time the ADC uses to sample the input voltage</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>3us</name>
                    <description>3 us</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>5us</name>
                    <description>5 us</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10us</name>
                    <description>10 us</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>15us</name>
                    <description>15 us</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20us</name>
                    <description>20 us</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40us</name>
                    <description>40 us</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1us</name>
                    <description>1 us</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2us</name>
                    <description>2 us</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Enable differential mode</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SE</name>
                    <description>Single ended, PSELN will be ignored, negative input to ADC shorted to GND</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Diff</name>
                    <description>Differential</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURST</name>
                <description>Enable burst mode</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Burst mode is disabled (normal operation)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as fast as it can, and sends the average to Data RAM.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LIMIT</name>
            <description>Description cluster[0]:  High/low limits for event monitoring a channel</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF8000</resetValue>
            <fields>
              <field>
                <name>LOW</name>
                <description>Low level limit</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>High level limit</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>REGRESULT</name>
          <description>Last conversion result</description>
          <addressOffset>0x5EC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REGRESULT</name>
              <description>Result of the previous ADC conversion</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLUTION</name>
          <description>Resolution configuration</description>
          <addressOffset>0x5F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>Set the resolution</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10bit</name>
                  <description>10 bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12bit</name>
                  <description>12 bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14bit</name>
                  <description>14 bit</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16bit</name>
                  <description>16 bit</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
