jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NFCT</name>
      <description>NFC-A compatible radio</description>
      <groupName>NFCT</groupName>
      <baseAddress>0x40011000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>NFCT</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_ACTIVATE</name>
          <description>Activate NFC peripheral for incoming and outgoing frames, change state to activated</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DISABLE</name>
          <description>Disable NFC peripheral</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_SENSE</name>
          <description>Enable NFC sense field mode, change state to sense mode</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STARTTX</name>
          <description>Start transmission of a outgoing frame, change state to transmit</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOPTX</name>
          <description>Stops a issued transmission of a frame</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_START_ROSCCAL</name>
          <description>Starts calibration of ring oscillator</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_FREQMEASURE</name>
          <description>Measures the 13.56 MHz clock frequency</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_ENABLERXDATA</name>
          <description>Initializes the EasyDMA for receive.</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DISABLERXDATA</name>
          <description>Ends current EasyDMA transfer and stops waiting for SoF</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_GOIDLE</name>
          <description>Force state machine to IDLE state</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_GOSLEEP</name>
          <description>Force state machine to SLEEP_A state</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>SUBSCRIBE_ACTIVATE</name>
          <description>Subscribe configuration for TASKS_ACTIVATE</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_ACTIVATE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DISABLE</name>
          <description>Subscribe configuration for TASKS_DISABLE</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DISABLE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SENSE</name>
          <description>Subscribe configuration for TASKS_SENSE</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_SENSE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTTX</name>
          <description>Subscribe configuration for TASKS_STARTTX</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STARTTX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOPTX</name>
          <description>Subscribe configuration for TASKS_STOPTX</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STOPTX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START_ROSCCAL</name>
          <description>Subscribe configuration for TASKS_START_ROSCCAL</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_START_ROSCCAL will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_FREQMEASURE</name>
          <description>Subscribe configuration for TASKS_FREQMEASURE</description>
          <addressOffset>0x098</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_FREQMEASURE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_ENABLERXDATA</name>
          <description>Subscribe configuration for TASKS_ENABLERXDATA</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_ENABLERXDATA will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DISABLERXDATA</name>
          <description>Subscribe configuration for TASKS_DISABLERXDATA</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DISABLERXDATA will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_GOIDLE</name>
          <description>Subscribe configuration for TASKS_GOIDLE</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_GOIDLE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_GOSLEEP</name>
          <description>Subscribe configuration for TASKS_GOSLEEP</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_GOSLEEP will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>The NFC peripheral is ready to receive and send frames</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_FIELDDETECTED</name>
          <description>Remote NFC field detected</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_FIELDLOST</name>
          <description>Remote NFC field lost</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_TXFRAMESTART</name>
          <description>Marks the start of the first symbol of a transmitted frame</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_TXFRAMEEND</name>
          <description>Marks the end of the last transmitted on-air symbol of a frame data bit on the last positive edge ckTxNfc with nfcTransmit = 1</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_RXFRAMESTART</name>
          <description>Marks the end of the first symbol of a received frame</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_RXFRAMEEND</name>
          <description>Received data have been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended accessing the RX buffer</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ERROR</name>
          <description>NFC error reported. The ERRORSTATUS register contains details on the source of the error.</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_FREQMEASUREDONE</name>
          <description>Done with one frequency measurement, result available in the MEASUREDFREQ register. This event will fire several times during calibration.</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_CALCOMPLETE</name>
          <description>NFC ring oscillator calibration complete.</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_RXERROR</name>
          <description>NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error.</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ENDRX</name>
          <description>RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full.</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ENDTX</name>
          <description>Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_AUTOCOLRESSTARTED</name>
          <description>Auto collision resolution process has started Event generated when ALL_REQ or SENS_REQ has been received while is IDLE state</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_AUTOCOLRES1</name>
          <description>Auto collision resolution cascade level 1 succeeded</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_AUTOCOLRES2</name>
          <description>Auto collision resolution cascade level 2 succeeded</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_AUTOCOLRES3</name>
          <description>Auto collision resolution cascade level 3 succeeded</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_COLLISION</name>
          <description>NFC Auto collision resolution error reported. The AUTOCOLRESSTATUS register contains details on the source of the error.</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_SELECTED</name>
          <description>NFC Auto collision resolution successfully completed</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>EasyDMA is ready to receive or send frames.</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PUBLISH_READY</name>
          <description>Publish configuration for EVENTS_READY</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_READY will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_FIELDDETECTED</name>
          <description>Publish configuration for EVENTS_FIELDDETECTED</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_FIELDDETECTED will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
