jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>FRAMEDELAYMODE</name>
          <description>Configuration register for the Frame Delay Timer</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FRAMEDELAYMODE</name>
              <description>Configuration register for the Frame Delay Timer</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FreeRun</name>
                  <description>Transmission is independent of frame timer and will start when the STARTTX task is triggered. No timeout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Window</name>
                  <description>Frame is transmitted between FRAMEDELAYMIN and FRAMEDELAYMAX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExactVal</name>
                  <description>Frame is transmitted exactly at FRAMEDELAYMAX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WindowGrid</name>
                  <description>Frame is transmitted on a bit grid between FRAMEDELAYMIN and FRAMEDELAYMAX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETPTR</name>
          <description>Packet pointer for TXD and RXD data storage in Data RAM</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PTR</name>
              <description>Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte aligned RAM address.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXLEN</name>
          <description>Size of allocated for TXD and RXD data storage buffer in Data RAM</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Size of allocated for TXD and RXD data storage buffer in Data RAM</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TXD</name>
          <description>Unspecified</description>
          <headerStructName>NFCT_TXD</headerStructName>
          <addressOffset>0x518</addressOffset>
          <register>
            <name>FRAMECONFIG</name>
            <description>Configuration of outgoing frames</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <fields>
              <field>
                <name>PARITY</name>
                <description>Adding parity or not in the frame</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoParity</name>
                    <description>Parity is not added in TX frames</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Parity</name>
                    <description>Parity is added TX frames</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISCARDMODE</name>
                <description>Discarding unused bits in start or at end of a Frame</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DiscardEnd</name>
                    <description>Unused bits is discarded at end of frame</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardStart</name>
                    <description>Unused bits is discarded at start of frame</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SOF</name>
                <description>Adding SoF or not in TX frames</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoSoF</name>
                    <description>Start of Frame symbol not added</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SoF</name>
                    <description>Start of Frame symbol added</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRCMODETX</name>
                <description>CRC mode for outgoing frames</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoCRCTX</name>
                    <description>CRC is not added to the frame</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRC16TX</name>
                    <description>16 bit CRC added to the frame based on all the data read from RAM that is used in the frame</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Size of outgoing frame</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>TXDATABITS</name>
                <description>Number of bits in the last or first byte read from RAM that shall be included in the frame (excluding parity bit).</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TXDATABYTES</name>
                <description>Number of complete bytes that shall be included in the frame, excluding CRC, parity and framing</description>
                <lsb>3</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXD</name>
          <description>Unspecified</description>
          <headerStructName>NFCT_RXD</headerStructName>
          <addressOffset>0x520</addressOffset>
          <register>
            <name>FRAMECONFIG</name>
            <description>Configuration of incoming frames</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000015</resetValue>
            <fields>
              <field>
                <name>PARITY</name>
                <description>Parity expected or not in RX frame</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoParity</name>
                    <description>Parity is not expected in RX frames</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Parity</name>
                    <description>Parity is expected in RX frames</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SOF</name>
                <description>SoF expected or not in RX frames</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoSoF</name>
                    <description>Start of Frame symbol is not expected in RX frames</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SoF</name>
                    <description>Start of Frame symbol is expected in RX frames</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRCMODERX</name>
                <description>CRC mode for incoming frames</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoCRCRX</name>
                    <description>CRC is not expected in RX frames</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRC16RX</name>
                    <description>Last 16 bits in RX frame is CRC, CRC is checked and CRCSTATUS updated</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Size of last incoming frame</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>RXDATABITS</name>
                <description>Number of bits in the last byte in the frame, if less than 8 (including CRC, but excluding parity and SoF/EoF framing).</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RXDATABYTES</name>
                <description>Number of complete bytes received in the frame (including CRC, but excluding parity and SoF/EoF framing)</description>
                <lsb>3</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FRAMEDELAYSHIFT</name>
          <description>Correction for the frame delay reference</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>FRAMEDELAYSHIFT</name>
              <description>Fine offset for the reference time for frame timing controller counter, measured in carrier frequency periods. Value 8 is no offset. Values greater than 8 means the frame timing controller counter reaches early to FRAMEDELAYMIN and values less than 8 means the counter reaches FRAMEDELAYMIN late.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001021</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial. Each term in the CRC polynomial is mapped to a bit in this register which index corresponds to the term's exponent. The most significant term (bit 16) is hardwired to 1, and not reflected in the register. The following example is for a 16-bit CRC polynomial: (x16 +) x12 + x5 + 1 = (1) 0001 0000 0010 0001 = 0x1021 (x16 is implicitly 1 and does not need to be written to the register)</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006363</resetValue>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>Initial value for CRC calculation</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCA</name>
                  <description>Initial value for NFC-A</description>
                  <value>0x6363</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCBF</name>
                  <description>Initial value for NFC-B and NFC-F</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCID1_LAST</name>
          <description>Last NFCID1 part (4, 7 or 10 bytes ID)</description>
          <addressOffset>0x590</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006363</resetValue>
          <fields>
            <field>
              <name>NFCID1_Z</name>
              <description>NFCID1 byte Z (very last byte sent)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>NFCID1_Y</name>
              <description>NFCID1 byte Y</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NFCID1_X</name>
              <description>NFCID1 byte X</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>NFCID1_W</name>
              <description>NFCID1 byte W</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCID1_2ND_LAST</name>
          <description>Second last NFCID1 part (7 or 10 bytes ID)</description>
          <addressOffset>0x594</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>NFCID1_V</name>
              <description>NFCID1 byte V</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>NFCID1_U</name>
              <description>NFCID1 byte U</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NFCID1_T</name>
              <description>NFCID1 byte T</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCID1_3RD_LAST</name>
          <description>Third last NFCID1 part (10 bytes ID)</description>
          <addressOffset>0x598</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>NFCID1_S</name>
              <description>NFCID1 byte S</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>NFCID1_R</name>
              <description>NFCID1 byte R</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NFCID1_Q</name>
              <description>NFCID1 byte Q</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCOLRESCONFIG</name>
          <description>Controls the Auto collision resolution function. This setting must be done before the NFCT peripheral is enabled.</description>
          <addressOffset>0x59C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Enables/disables Auto collision resolution</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Auto collision resolution enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Auto collision resolution disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTER</name>
              <description>Enables/disables Auto collision resolution short frame (any frames less than 7 bits) noise filter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Auto collision resolution short frame noise filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Auto collision resolution ignores any frames less than 7 bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSRES</name>
          <description>NFC-A SENS_RES auto-response settings</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>BITFRAMESDD</name>
              <description>Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDD00000</name>
                  <description>SDD pattern 00000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00001</name>
                  <description>SDD pattern 00001</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00010</name>
                  <description>SDD pattern 00010</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00100</name>
                  <description>SDD pattern 00100</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD01000</name>
                  <description>SDD pattern 01000</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD10000</name>
                  <description>SDD pattern 10000</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFU5</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>NFCIDSIZE</name>
              <description>NFCID1 size. This value is used by the Auto collision resolution engine.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCID1Single</name>
                  <description>NFCID1 size: single (4 bytes)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Double</name>
                  <description>NFCID1 size: double (7 bytes)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Triple</name>
                  <description>NFCID1 size: triple (10 bytes)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLATFCONFIG</name>
              <description>Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RFU74</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SELRES</name>
          <description>NFC-A SEL_RES auto-response settings</description>
          <addressOffset>0x5A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RFU10</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CASCADE</name>
              <description>Cascade bit (controlled by hardware, write has no effect)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Complete</name>
                  <description>NFCID1 complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotComplete</name>
                  <description>NFCID1 not complete</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFU43</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>3</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>5</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RFU7</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
