jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>SHUNTREGCONFIG</name>
          <description>Configuration for NFCT_SHUNTREG_TSMC55N</description>
          <addressOffset>0x68C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00038148</resetValue>
          <fields>
            <field>
              <name>RFU</name>
              <description>Reserved for future use</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>PEAKKDETECTCAPTUNE</name>
              <description>Capacitance tuning in peak detection block for swing programmability. The C1 and C2 are coming from, Vpeak-swing = Vref * ((C1 + C2) / C1),  Vpeak-swing is NFC swing, Vref is from PEAKDETECTREFINIT</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEAKKDETECTCAPTUNE_0</name>
                  <description>C2=96fF,C1=266fF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKKDETECTCAPTUNE_1</name>
                  <description>C2=116fF,C1=266fF (highest swing)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKKDETECTCAPTUNE_2</name>
                  <description>C2=22fF,C1=266fF (lowest swing)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKKDETECTCAPTUNE_3</name>
                  <description>C2=52fF,C1=266fF</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEAKDETECTREFINIT</name>
              <description>Initial peak detect reference value</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_0</name>
                  <description>1040 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_1</name>
                  <description>1000 mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_2</name>
                  <description>960 mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_3</name>
                  <description>920 mV</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_4</name>
                  <description>880 mV</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_5</name>
                  <description>840 mV</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_6</name>
                  <description>800 mV</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTREFINIT_7</name>
                  <description>760 mV</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEAKDETECTORCMVOLTAGE</name>
              <description>Peak detector common mode voltage tuning</description>
              <lsb>7</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEAKDETECTORCMVOLTAGE_0</name>
                  <description>120mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTORCMVOLTAGE_1</name>
                  <description>80mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTORCMVOLTAGE_2</name>
                  <description>40mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTORCMVOLTAGE_3</name>
                  <description>0mV</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFU1</name>
              <description>Reserved for future use</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>SELOPENLOOP</name>
              <description>This sets the shunt regulation in open loop mode</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELOPENLOOP_Disabled</name>
                  <description>Closed loop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELOPENLOOP_Enabled</name>
                  <description>Open loop mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELOPENLOOPGATECTRL</name>
              <description>Set the gate voltage on shunt NMOS</description>
              <lsb>11</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELOPENLOOPGATECTRL_0</name>
                  <description>Vdd</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELOPENLOOPGATECTRL_1</name>
                  <description>0.75 * Vdd</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELOPENLOOPGATECTRL_2</name>
                  <description>0.5 * Vdd</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELOPENLOOPGATECTRL_3</name>
                  <description>0mV</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMFBCMREF</name>
              <description>Common mode reference for CMFB circuit</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMFBCMREF_0</name>
                  <description>0.7 * Vdd</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_1</name>
                  <description>0.65 * Vdd</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_2</name>
                  <description>0.6 * Vdd</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_3</name>
                  <description>0.55 * Vdd</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_4</name>
                  <description>0.5 * Vdd</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_5</name>
                  <description>0.45 * Vdd</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_6</name>
                  <description>0.4 * Vdd</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBCMREF_7</name>
                  <description>0.35 * Vdd</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMFBEN</name>
              <description>Enable CMFB circuit</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Feature disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Feature enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMFBOFFSETEN</name>
              <description>Enable the CMFB offset from the CMFB circuit</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Feature disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Feature enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOADMODCONFIG</name>
          <description>Configuration for load modulation</description>
          <addressOffset>0x690</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FC0</resetValue>
          <fields>
            <field>
              <name>LOADMODCONFIGOFF</name>
              <description>Load modulation value when modulation is off. The value has to be 0. Changing it would give undesired results.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>LOADMODCONFIGON</name>
              <description>Load modulation value when modulation is on</description>
              <lsb>6</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SHUNTNMOSADJUST</name>
          <description>Size adjustment for the shunt NMOS in shunt regulator</description>
          <addressOffset>0x694</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHUNTNMOSADJUST</name>
              <description>Size adjustment for shunt NMOS in shunt regulator</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSHUNTCTRL</name>
          <description>Adjust internal shunt resistance</description>
          <addressOffset>0x698</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSHUNTCTRL</name>
              <description>Adjust internal shunt resistance</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPEAKDETECTREF</name>
          <description>Override value for the peak detect reference voltage</description>
          <addressOffset>0x69C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>OVRVALPEAKDETECTREF</name>
              <description>Override value for the peak detect reference voltage</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_0</name>
                  <description>1240 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_1</name>
                  <description>1200 mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_2</name>
                  <description>1160 mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_3</name>
                  <description>1120 mV</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_4</name>
                  <description>1080 mV</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_5</name>
                  <description>1040 mV</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_6</name>
                  <description>1000 mV</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRVALPEAKDETECTREF_7</name>
                  <description>960 mV</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKDETECTWINDOW</name>
          <description>Adjust window size on falling edge of lock detect filter used for demodulation</description>
          <addressOffset>0x6A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>LOCKDETECTWINDOW</name>
              <description>Adjust window size on falling edge of lock detect filter used for demodulation</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
