jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Pulse Width Modulation Unit</description>
      <groupName>PWM</groupName>
      <baseAddress>0x40016000</baseAddress>
      <size>32</size>
      <headerStructName>PWM</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM0</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Starts PWM pulse generation with the last loaded values</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>TASKS_SEQSTART[%s]</name>
          <description>Description collection[0]:  Loads the first PWM value on all enabled channels from sequence 0, and starts playing that sequence at the rate defined in SEQ[0]REFRESH and/or DECODER.MODE. Causes PWM generation to start it was not running. Sending a SEQSTART[0] task while a sequence is already playing back will gracefully (i.e. glitch-free) abort that sequence at the earliest opportunity and start sequence 0.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_NEXTSTEP</name>
          <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start it was not running.</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_SEQABORT</name>
          <description>(Gracefully) aborts the playback of the current sequence or the current end delay.</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for TASKS_START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_START will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for TASKS_STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STOP will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>SUBSCRIBE_SEQSTART[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_SEQSTART[0]</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_SEQSTART[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_NEXTSTEP</name>
          <description>Subscribe configuration for TASKS_NEXTSTEP</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_NEXTSTEP will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SEQABORT</name>
          <description>Subscribe configuration for TASKS_SEQABORT</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_SEQABORT will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Response to START task, emitted when PWM pulses start to get generated</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EVENTS_SEQSTARTED[%s]</name>
          <description>Description collection[0]:  First PWM period started on sequence 0</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EVENTS_SEQEND[%s]</name>
          <description>Description collection[0]:  Emitted at end of every sequence 0, when last value from RAM has been applied to wave counter</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_PWMPERIODEND</name>
          <description>Emitted at the end of each PWM period</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_LOOPSDONE</name>
          <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_RAMUNDERFLOW</name>
          <description>Emitted when a RAM fecth does not complete in time for the PWM module</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EVENTS_DMAREADY[%s]</name>
          <description>Description collection[0]:  Emitted when EasyDMA has fetched .PTR and .CNT registers for sequence 0 (they can be prepared for the next sequence)</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>EVENTS_DMAEND[%s]</name>
          <description>Description collection[0]:  Emitted when EasyDMA has finished fetching values of sequence 0 from RAM buffer</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PUBLISH_STARTED</name>
          <description>Publish configuration for EVENTS_STARTED</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_STARTED will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_STOPPED</name>
          <description>Publish configuration for EVENTS_STOPPED</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_STOPPED will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PUBLISH_SEQSTARTED[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_SEQSTARTED[0]</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_SEQSTARTED[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PUBLISH_SEQEND[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_SEQEND[0]</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_SEQEND[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PWMPERIODEND</name>
          <description>Publish configuration for EVENTS_PWMPERIODEND</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_PWMPERIODEND will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_LOOPSDONE</name>
          <description>Publish configuration for EVENTS_LOOPSDONE</description>
          <addressOffset>0x19C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_LOOPSDONE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RAMUNDERFLOW</name>
          <description>Publish configuration for EVENTS_RAMUNDERFLOW</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_RAMUNDERFLOW will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PUBLISH_DMAREADY[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_DMAREADY[0]</description>
          <addressOffset>0x1A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_DMAREADY[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PUBLISH_DMAEND[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_DMAEND[0]</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_DMAEND[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
