jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>ENABLE</name>
          <description>PDM module enable register</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable PDM module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMCLKCTRL</name>
          <description>PDM clock generator control</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x08400000</resetValue>
          <fields>
            <field>
              <name>FREQ</name>
              <description>PDM_CLK frequency</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1000K</name>
                  <description>PDM_CLK = 32 MHz / 32 = 1.000 MHz</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Default</name>
                  <description>PDM_CLK = 32 MHz / 31 = 1.032 MHz Assumes a 20 bit Baud Rate Generator (BRG) dividing the 32 MHz clock. Output of BRG is connected to PDM_CLK, the filter source clock requires twice that rate, a frequency doubler is built in the module to provide 2.048 MHz, which implies a filter clockdiv ratio hardcoded at x2 to the IP.</description>
                  <value>0x08400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1067K</name>
                  <description>PDM_CLK = 32 MHz / 30 = 1.067 MHz</description>
                  <value>0x08800000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Defines the routing of the connected PDM microphones' signals</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPERATION</name>
              <description>Mono or stereo operation Mono also disables the gated clock to the right filter bank</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stereo</name>
                  <description>Sample and store one pair (Left + Right) of 16bit samples per RAM word R=[31:16]; L=[15:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mono</name>
                  <description>Sample and store two successive Left samples (16 bit each) per RAM word L1=[31:16]; L0=[15:0]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Defines on which PDM_CLK edge Left (or mono) is sampled</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LeftFalling</name>
                  <description>Left (or mono) is sampled on falling edge of PDM_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LeftRising</name>
                  <description>Left (or mono) is sampled on rising edge of PDM_CLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDBYPASS</name>
          <description>Bypass the frequency doubler in the PDM clock generation</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Bypass the frequency doubler in the PDM clock generation, and revert to a simple divider structure.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoublerActive</name>
                  <description>PDMCLKCTRL determines directly the PDM_CLK frequency. A doubler is used to provide twice that clock to the filters. This allows better accuracy on PDM_CLK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DividerActive</name>
                  <description>PDMCLKCTRL determines the clock provided to the filters, PDM_CLK is generated by dividing that clock by two. This results in less accuracy on PDM_CLK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLDATA</name>
          <description>Left sample from filter output</description>
          <addressOffset>0x510</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDLDATA</name>
              <description>Left sample from filter output</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDRDATA</name>
          <description>Right sample from filter output</description>
          <addressOffset>0x514</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDRDATA</name>
              <description>Right sample from filter output</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINL</name>
          <description>Left output gain adjustment</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>GAINL</name>
              <description>Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters) 0x00    -20 dB gain adjust 0x01  -19.5 dB gain adjust (...) 0x27   -0.5 dB gain adjust 0x28      0 dB gain adjust 0x29   +0.5 dB gain adjust (...) 0x4F  +19.5 dB gain adjust 0x50    +20 dB gain adjust 0x51    +20 dB gain adjust 0x52    +20 dB gain adjust (...)</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0dB gain adjustment ('2500 RMS' requirement)</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINR</name>
          <description>Right output gain adjustment</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>GAINR</name>
              <description>Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0dB gain adjustment ('2500 RMS' requirement)</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>FILTER</name>
          <description>Unspecified</description>
          <headerStructName>PDM_FILTER</headerStructName>
          <addressOffset>0x528</addressOffset>
          <register>
            <name>HPPOLE</name>
            <description>Settings for the high-pass filter</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000C</resetValue>
            <fields>
              <field>
                <name>HPPOLE</name>
                <description>Settings for the high-pass filter -3dB gain pole, assuming filter source clock of 2.048 MHz</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>p10</name>
                    <description>10 Hz</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p20</name>
                    <description>20 Hz</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p40</name>
                    <description>40 Hz</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p80</name>
                    <description>80 Hz</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p160</name>
                    <description>159 Hz</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p320</name>
                    <description>318 Hz</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p640</name>
                    <description>636 Hz</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p1k2</name>
                    <description>1271 Hz</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p2k5</name>
                    <description>2537 Hz</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p5k</name>
                    <description>5054 Hz</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p10k</name>
                    <description>10031 Hz</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p19k</name>
                    <description>19767 Hz</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p38k</name>
                    <description>38436 Hz</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p73k</name>
                    <description>73037 Hz</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p134k</name>
                    <description>134010 Hz</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HPDISABLE</name>
            <description>High pass filter disable</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>High pass filter disable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>High pass filter enabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>High pass filter disabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOFTMUTE</name>
            <description>Soft mute function</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Soft mute function</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable soft mute function</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable soft mute function</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOFTCYCLES</name>
            <description>Soft mute settings</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Soft mute settings: amount of cycles for transition</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>s16</name>
                    <description>16 filter source clock cycles</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s32</name>
                    <description>32 filter source clock cycles</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s48</name>
                    <description>48 filter source clock cycles</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s64</name>
                    <description>64 filter source clock cycles</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s80</name>
                    <description>80 filter source clock cycles</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s96</name>
                    <description>96 filter source clock cycles</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s112</name>
                    <description>112 filter source clock cycles</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s128</name>
                    <description>128 filter source clock cycles</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLEDELAY</name>
            <description>Input Data Sampling with Number of PDM_CLK Clock Cycle Delay</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DELAY</name>
                <description>Input Data Sampling with Number of PDM_CLK Clock Cycle Delay</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>x2</name>
                    <description>2x cycles</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>x4</name>
                    <description>4x cycles</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PHASE</name>
          <description>Selection of delay on the clock line (to avoid potential setup&amp;amp;hold timing violation on input data)</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHASE</name>
              <description>To avoid potential setup&amp;amp;hold timing violation on input data, this register provides selection between 14 phase delay registers (15 taps), which each provide an additional 31.25ns delay of pdmClockToPad relative to pdmClockToFilter.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>PDM_PSEL</headerStructName>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>CLK</name>
            <description>Pin number configuration for PDM CLK signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIN</name>
            <description>Pin number configuration for PDM DIN signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TSEL</name>
          <description>Trim value for ramTSEL[1:0] on the RamBist interface</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RAMTSEL</name>
              <description>Trim value for ramTSEL[1:0] on the RamBist interface</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SAMPLE</name>
          <description>Unspecified</description>
          <headerStructName>PDM_SAMPLE</headerStructName>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>PTR</name>
            <description>RAM address pointer to write samples to with EasyDMA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SAMPLEPTR</name>
                <description>Address to write PDM samples to over DMA</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
