jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
          <register>
            <name>MAXCNT</name>
            <description>Number of samples to allocate memory for in EasyDMA mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUFFSIZE</name>
                <description>Length of DMA RAM allocation in number of samples</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of samples transferred into Data RAM since last START task</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of samples transferred into Data RAM since last START task</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <description>Inter-IC Sound</description>
      <groupName>I2S</groupName>
      <baseAddress>0x40018000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2S</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Starts continuous I2S transfer. Also starts MCK generator when this is enabled.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops I2S transfer. Also stops MCK generator. Triggering this task will cause the {event:STOPPED} event to be generated.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DMA_START_TX</name>
          <description>Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_TX.</description>
          <addressOffset>0x030</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DMA_START_RX</name>
          <description>Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_RX.</description>
          <addressOffset>0x034</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DMA_STOP_TX</name>
          <description>Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_TX.</description>
          <addressOffset>0x038</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DMA_STOP_RX</name>
          <description>Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_RX.</description>
          <addressOffset>0x03C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for TASKS_START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_START will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for TASKS_STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STOP will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMA_START_TX</name>
          <description>Subscribe configuration for TASKS_DMA_START_TX</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DMA_START_TX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMA_START_RX</name>
          <description>Subscribe configuration for TASKS_DMA_START_RX</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DMA_START_RX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMA_STOP_TX</name>
          <description>Subscribe configuration for TASKS_DMA_STOP_TX</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DMA_STOP_TX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMA_STOP_RX</name>
          <description>Subscribe configuration for TASKS_DMA_STOP_RX</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DMA_STOP_RX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DMA_END_TX</name>
          <description>Equivalent to eventDmaEndTx</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_RXPTRUPD</name>
          <description>The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and RX is enabled, this event will be generated for every RXTXD.MAXCNT words that are received on the SDIN pin. Equivalent to eventDmaReadyRx.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>I2S transfer stopped. There are no requirements to how "graceful" the I2S module shall be stopped. The reason for this is that we are talking about streaming audio data here, and thus loosing some data is not critical. Graceful stopping of stream can easily be done in FW. Equivalent to eventStopped</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ERROR_TX</name>
          <description>DMA read from memory failed. Equivalent to eventUnderflowTx</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ERROR_RX</name>
          <description>DMA write to memory failed. Equivalent to eventOverflowRx</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_TXPTRUPD</name>
          <description>The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. Equivalent to eventDmaReadyTx.</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_DMA_END_RX</name>
          <description>DMA write to memory failed. Equivalent to eventDmaEndRx</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PUBLISH_DMA_END_TX</name>
          <description>Publish configuration for EVENTS_DMA_END_TX</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_DMA_END_TX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RXPTRUPD</name>
          <description>Publish configuration for EVENTS_RXPTRUPD</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_RXPTRUPD will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_STOPPED</name>
          <description>Publish configuration for EVENTS_STOPPED</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_STOPPED will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ERROR_TX</name>
          <description>Publish configuration for EVENTS_ERROR_TX</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_ERROR_TX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ERROR_RX</name>
          <description>Publish configuration for EVENTS_ERROR_RX</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_ERROR_RX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TXPTRUPD</name>
          <description>Publish configuration for EVENTS_TXPTRUPD</description>
          <addressOffset>0x194</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_TXPTRUPD will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DMA_END_RX</name>
          <description>Publish configuration for EVENTS_DMA_END_RX</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_DMA_END_RX will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
