jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
          <register>
            <name>IO1</name>
            <description>Pin select for serial data MISO/IO1. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO2</name>
            <description>Pin select for serial data IO2. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO3</name>
            <description>Pin select for serial data IO3. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XIPOFFSET</name>
          <description>Address offset into the external memory for Execute in Place operation.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>XIPOFFSET</name>
              <description>Address offset into the external memory for Execute in Place operation. Value must be a multiple of 4.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG0</name>
          <description>Interface configuration. SPI MEM CTRL Default Memory reg.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READOC</name>
              <description>Configure number of data lines and opcode used for reading.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FastRead</name>
                  <description>Single data line SPI. FAST_READ (opcode 0x0B).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Read2O</name>
                  <description>Dual data line SPI. READ2O (opcode 0x3B).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Read2IO</name>
                  <description>Dual data line SPI. READ2IO (opcode 0xBB).</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEOC</name>
              <description>Configure number of data lines and opcode used for writing.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Single data line SPI. PP (opcode 0x02).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP2O</name>
                  <description>Dual data line SPI. PP2O (opcode 0xA2).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4O</name>
                  <description>Quad data line SPI. PP4O (opcode 0x32).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4IO</name>
                  <description>Quad data line SPI. READ4O (opcode 0x38).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRMODE</name>
              <description>Addressing mode.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <description>24-bit addressing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit addressing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPMENABLE</name>
              <description>Enable Deep Power-down mode (DPM) feature.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable DPM feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable DPM feature.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSNLINE</name>
              <description>Chip select line.</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>AUTO</name>
              <description>Automatic identification of external Flash memory. 0=manual, 1=automatic</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG1</name>
          <description>Interface configuration. SPI MEM CTRL Control reg.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040400</resetValue>
          <fields>
            <field>
              <name>SCKDELAY</name>
              <description>tSHSL, tWHSL and tSHWL in number of 16 MHz periods (62.5 ns).</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>FIFOTHR</name>
              <description>Read FIFO threshold.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>FIFOTHW</name>
              <description>Write FIFO threshold.</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>DPMEN</name>
              <description>Enter/exit Deep Power-down Mode (DPM) for external Flash memory.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exit</name>
                  <description>Exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enter DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMODE</name>
              <description>Select SPI mode.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Mode 0 (CPOL=0, CPHA=0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Mode 1 (CPOL=1, CPHA=1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset external Flash memory device. Write 1 to reset. Must be written back to 0 after a minimum delay of 1 us.</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>SCKFREQ</name>
              <description>SCK frequency is given as 32 MHz / (SCKFREQ + 1).</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status register. SPI MEM CTRL Status reg.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDATAREADY</name>
              <description>Internal RX FIFO contains data from external Flash.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>TXDATAREADY</name>
              <description>Internal TX FIFO contains data not yet written to external Flash.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DPM</name>
              <description>Deep Power-down Mode (DPM) status of external Flash.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>External flash is not in DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>External flash is in DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Ready status.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQREADY</name>
              <description>1: Ready to serve access request.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SREG</name>
              <description>Value of external Flash devices Status Register. When the external Flash has two bytes status register this field includes the value of the low byte.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ0</name>
          <description>Access request, word 0. SPI MEM CTRL Access Request reg. 0.</description>
          <addressOffset>0x608</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACCESSREQ0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ1</name>
          <description>Access request, word 1. SPI MEM CTRL Access Request reg. 1.</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACCESSREQ1</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ2</name>
          <description>Access request, word 2. SPI MEM CTRL Access Request reg. 2.</description>
          <addressOffset>0x610</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACCESSREQ2</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DPMDUR</name>
          <description>Set the duration required to enter/exit Deep Power-down Mode (DPM). SPI MEM CTRL Duration DPM reg.</description>
          <addressOffset>0x614</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENTER</name>
              <description>Duration need by external Flash to enter DPM. Duration is given as ENTER * 256 * 62.5 ns.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EXIT</name>
              <description>Duration need by external Flash to exit DPM. Duration is given as EXIT * 256 * 62.5 ns.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DATARW</name>
          <description>Read data when read, write data when written. SPI MEM CTRL Read/Write Data reg.</description>
          <addressOffset>0x618</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATARW</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTAT</name>
          <description>The number of items in Read and Write FIFOs. SPI MEM CTRL FIFOs Status reg.</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FIFOSTAT</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFMEM</name>
          <description>Default memory register. SPI MEM Default memory register. Fields adn content equivalent to IFCONFIG0.</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEFMEM</name>
              <description>Default memory register.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRCONFIG</name>
          <description>Extended address configuration. SPI MEM CTRL Extended Addressing Mode reg.</description>
          <addressOffset>0x624</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode that enters the 32-bit addressing mode.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE0</name>
              <description>Byte 0 following opcode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Byte 1 following byte 0.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Extended addressing mode.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoInstr</name>
                  <description>Do not send any instruction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Opcode</name>
                  <description>Send opcode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpByte0</name>
                  <description>Send opcode, byte0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>All</name>
                  <description>Send opcode, byte0, byte1.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for "write complete" before sending command.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN(write enable opcode 0x06) before instruction.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMSPEC</name>
          <description>Byte specification: 1 byte manufacture ID, 1 byte memory type, 1 byte density. SPI MEM CTRL Memory Specification reg.</description>
          <addressOffset>0x628</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEMSPEC</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQMSK</name>
          <description>Interrupts enable disable mask. SPI MEM CTRL Interrupt Mask reg.</description>
          <addressOffset>0x62C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQMSK</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQREQ</name>
          <description>Interrupt request register (reason for triggering interrupt signal). SPI MEM CTRL Interrupt Request reg.</description>
          <addressOffset>0x630</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQREQ</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
