jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>CINSTRCONF</name>
          <description>Custom instruction configuration register. SPI MEM CTRL Custom Instruction Setup reg.</description>
          <addressOffset>0x634</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode of Custom instruction.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LENGTH</name>
              <description>Length of custom instruction in number of bytes.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1B</name>
                  <description>Send opcode only.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE3.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE4.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE5.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE6.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE7.</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIO2</name>
              <description>Level of the IO2 pin (if connected) during transmission of custom instruction.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>LIO3</name>
              <description>Level of the IO3 pin (if connected) during transmission of custom instruction.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for "write complete" before sending command.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN(write enable opcode 0x06) before instruction.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT0</name>
          <description>Custom instruction data register 0. SPI MEM CTRL Custom Instruction Data reg. 0.</description>
          <addressOffset>0x638</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE0</name>
              <description>Data byte 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Data byte 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE2</name>
              <description>Data byte 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE3</name>
              <description>Data byte 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT1</name>
          <description>Custom instruction data register 1. SPI MEM CTRL Custom Instruction Data reg. 1.</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE4</name>
              <description>Data byte 4</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE5</name>
              <description>Data byte 5</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE6</name>
              <description>Data byte 6</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE7</name>
              <description>Data byte 7</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>READCYCLES</name>
          <description>Number of dummy cycles for Read Instructions. SPI MEM CTRL Read Dummy Cycles reg.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READCYCLES</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
