jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RTC0">
      <name>RTC1</name>
      <description>Real time counter 1</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4001B000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>RTC1</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USBD</name>
      <description>Universal Serial Bus device</description>
      <groupName>USBD</groupName>
      <baseAddress>0x4001F000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBD</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_USBDREINIT</name>
          <description>Resets the whole USBD peripheral. This includes disabling the pull-up on D+.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>TASKS_STARTEPIN[%s]</name>
          <description>Description collection[0]:  Captures the EPIN[0].PTR, EPIN[0].MAXCNT and EPIN[0].CONFIG registers values, and enables endpoint IN 0 to respond to traffic from host</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STARTISOIN</name>
          <description>Description collection[0]:  Captures the ISOIN[0].PTR, ISOIN[0].MAXCNT and ISOIN[0].CONFIG registers values, and enables sending data on iso endpoint</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>TASKS_STARTEPOUT[%s]</name>
          <description>Description collection[0]:  Captures the EPOUT[0].PTR, EPOUT[0].MAXCNT and EPOUT[0].CONFIG registers values, and enables endpoint 0 to respond to traffic from host</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STARTISOOUT</name>
          <description>Description collection[0]:  Captures the ISOOUT[0].PTR, ISOOUT[0].MAXCNT and ISOOUT[0].CONFIG registers values, and enables receiving of data on iso endpoint</description>
          <addressOffset>0x048</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_EP0RCVOUT</name>
          <description>Allows OUT data stage on control endpoint 0</description>
          <addressOffset>0x04C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_EP0STATUS</name>
          <description>Allows status stage on control endpoint 0</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_EP0STALL</name>
          <description>STALLs data and status stage on control endpoint 0</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DPDMDRIVE</name>
          <description>Forces D+ and D-lines to the state defined in the DPDMVALUE register</description>
          <addressOffset>0x058</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_DPDMNODRIVE</name>
          <description>Stops forcing D+ and D- lines to any state (USB engine takes control)</description>
          <addressOffset>0x05C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>SUBSCRIBE_USBDREINIT</name>
          <description>Subscribe configuration for TASKS_USBDREINIT</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_USBDREINIT will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SUBSCRIBE_STARTEPIN[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_STARTEPIN[0]</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STARTEPIN[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTISOIN</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_STARTISOIN[0]</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STARTISOIN[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>SUBSCRIBE_STARTEPOUT[%s]</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_STARTEPOUT[0]</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STARTEPOUT[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTISOOUT</name>
          <description>Description collection[0]:  Subscribe configuration for TASKS_STARTISOOUT[0]</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_STARTISOOUT[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0RCVOUT</name>
          <description>Subscribe configuration for TASKS_EP0RCVOUT</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_EP0RCVOUT will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0STATUS</name>
          <description>Subscribe configuration for TASKS_EP0STATUS</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_EP0STATUS will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0STALL</name>
          <description>Subscribe configuration for TASKS_EP0STALL</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_EP0STALL will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DPDMDRIVE</name>
          <description>Subscribe configuration for TASKS_DPDMDRIVE</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DPDMDRIVE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DPDMNODRIVE</name>
          <description>Subscribe configuration for TASKS_DPDMNODRIVE</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the TASKS_DPDMNODRIVE will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_USBRESET</name>
          <description>Signals that a USB reset condition has been detected on the USB lines</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Confirms that the EPIN[n].PTR, EPIN[n].MAXCNT, EPIN[n].CONFIG, or EPOUT[n].PTR, EPOUT[n].MAXCNT and EPOUT[n].CONFIG registers have been captured on all endpoints reported in the EPSTATUS register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>EVENTS_ENDEPIN[%s]</name>
          <description>Description collection[0]:  The whole EPIN[0] buffer has been consumed. The RAM buffer can be accessed safely by software.</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_EP0DATADONE</name>
          <description>An acknowledged data transfer has taken place on the control endpoint</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ENDISOIN</name>
          <description>Description collection[0]:  The whole ISOIN[0] buffer has been consumed. The RAM buffer can be accessed safely by software.</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>EVENTS_ENDEPOUT[%s]</name>
          <description>Description collection[0]:  The whole EPOUT[0] buffer has been consumed. The RAM buffer can be accessed safely by software.</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ENDISOOUT</name>
          <description>Description collection[0]:  The whole ISOOUT[0] buffer has been consumed. The RAM buffer can be accessed safely by software.</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_SOF</name>
          <description>Signals that a SOF (start of frame) condition has been detected on the USB lines</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_USBEVENT</name>
          <description>An event or an error not covered by specific events has occurred, check EVENTCAUSE register to find the cause</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_EP0SETUP</name>
          <description>A valid SETUP token has been received (and acknowledged) on the control endpoint</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_EPDATA</name>
          <description>A data transfer has occurred on a data endpoint, indicated by the EPDATASTATUS register</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_ACCESSFAULT</name>
          <description>Access to an unavailable USB register has been attempted (software or EasyDMA). This event can  get fired even when USBD is not ENABLEd.</description>
          <addressOffset>0x164</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PUBLISH_USBRESET</name>
          <description>Publish configuration for EVENTS_USBRESET</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_USBRESET will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_STARTED</name>
          <description>Publish configuration for EVENTS_STARTED</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_STARTED will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>PUBLISH_ENDEPIN[%s]</name>
          <description>Description collection[0]:  Publish configuration for EVENTS_ENDEPIN[0]</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel the EVENTS_ENDEPIN[0] will subscribe to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
