jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
        <register>
          <name>RAWDATA</name>
          <description>Actual read or write access to the raw IP, using RAWADDR address</description>
          <addressOffset>0x804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>data</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>REGRESET</name>
          <description>Registers reset. Writing any value to this register will reset all registers in this peripheral to their reset values. Read access to this register has no consequence. Not implemented in first silicon.</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REGRESET</name>
              <description>Writing any value to this register will reset all registers in this peripheral to their reset values. Read access to this register has no consequence.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMC</name>
      <description>Non Volatile Memory Controller</description>
      <groupName>NVMC</groupName>
      <baseAddress>0x40030000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC is ready or busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VERIFYFAILED</name>
          <description>Flag to signal that a flash erase or write operation has failed</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FAILED</name>
              <description>Indicates if an erase or write operation has failed. This bit will then remain set until next reset, even if successful writes or erases occur after a failing one.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OK</name>
                  <description>No erase or write operation has failed since last reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Failed</name>
                  <description>At least one erase or write operation has failed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROGMODE</name>
              <description>Deprecated field -  Halt CPU until current write or erase command is finished</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Halt</name>
                  <description>Halt CPU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoHalt</name>
                  <description>Do not halt CPU</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTPEMU</name>
              <description>Deprecated field -  OTP Emulation mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OTP Emulation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OTP Emulation enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGE</name>
          <description>Register for erasing a page in Code area</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEPAGE</name>
              <description>Register for starting erase of a page in Code area</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPCR1</name>
          <description>Deprecated register -  Register for erasing a page in Code area. Equivalent to ERASEPAGE.</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <alternateRegister>ERASEPAGE</alternateRegister>
          <fields>
            <field>
              <name>ERASEPCR1</name>
              <description>Register for erasing a page in Code area. Equivalent to ERASEPAGE.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Erase all non-volatile memory including UICR registers. Note that the erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPCR0</name>
          <description>Deprecated register -  Register for erasing a page in Code area. Equivalent to ERASEPAGE.</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEPCR0</name>
              <description>Register for starting erase of a page in Code area. Equivalent to ERASEPAGE.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEUICR</name>
          <description>Register for erasing User Information Configuration Registers</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEUICR</name>
              <description>Register starting erase of all User Information Configuration Registers. Note that the erase must be enabled using CONFIG.WEN before the UICR can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start erase of UICR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIAL</name>
          <description>Register for partial erase of a page in Code area</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEPAGEPARTIAL</name>
              <description>Register for starting partial erase of a page in Code area</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIALCFG</name>
          <description>Register for partial erase configuration</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>DURATION</name>
              <description>Duration of the partial erase in milliseconds</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSTATENUM</name>
          <description>Register to set the number of waitstate for flash access</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>WAITSTATENUM</name>
              <description>Register to set the number of waitstate for the flash acces</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHECNF</name>
          <description>I-Code cache configuration register.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CACHEEN</name>
              <description>Cache enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache. Invalidates all cache entries.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEPROFEN</name>
              <description>Cache profiling enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache profiling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache profiling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IHIT</name>
          <description>I-Code cache hit counter.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HITS</name>
              <description>Number of cache hits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IMISS</name>
          <description>I-Code cache miss counter.</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISSES</name>
              <description>Number of cache misses</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMODE</name>
          <description>Register for entering test mode. Refer to the flash IP test documentation for more details.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TESTMODE</name>
              <description>Register for entering test mode. Refer to the flash IP test documentation for more details. This register does not return the same value as written.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Read: Not in test-mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE1</name>
                  <description>Read: In test-mode 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE2</name>
                  <description>Read: In test-mode 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE3</name>
                  <description>Read: In test-mode 3.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>SetNORMAL</name>
                  <description>Write: Sets NORMAL mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE1</name>
                  <description>Write: Sets test-mode 1.</description>
                  <value>0xBCDE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE2</name>
                  <description>Write: Sets test-mode 2.</description>
                  <value>0xABCD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE3</name>
                  <description>Write: Sets test-mode 3.</description>
                  <value>0xCDEF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVEN</name>
          <description>Low Voltage Read Mode</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVEN</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNUSED0</name>
          <description>Unspecified</description>
          <addressOffset>0x608</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UNUSED1</name>
          <description>Unspecified</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TESTMASSERASE</name>
          <description>Self-timed mass-erase operation</description>
          <addressOffset>0x610</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TESTMASSERASE</name>
              <description>Self-timed mass-erase operation</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVERYTHING</name>
                  <description>Erase everything (all information pages and main block)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Erase only the main block</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION1</name>
                  <description>No operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTERASEREFCELL</name>
          <description>Self-timed erase reference cell operation</description>
          <addressOffset>0x614</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TESTERASEREFCELL</name>
              <description>Self-timed erase reference cell operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the erase reference cell operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TEST</name>
          <description>Unspecified</description>
          <headerStructName>NVMC_TEST</headerStructName>
          <addressOffset>0x618</addressOffset>
          <register>
            <name>TESTTC</name>
            <description>Description cluster[0]:  Observe the TC output from the flash macro</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>TC</name>
                <description>TC output</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-3</dimIndex>
            <name>TESTDATA128[%s]</name>
            <description>Description collection[0]:  Direct flash test data word 0</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Returns data out from flash when reading. Sets flash data in when writing.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
