jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-3</dimIndex>
            <name>TESTDATA128INC[%s]</name>
            <description>Description collection[0]:  Direct flash test data word 0. Post-increments TESTCONTROLADDR</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Returns data out from flash when reading. Use TESTDATA128[3:0] registers to set the compared data. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCMPINC</name>
            <description>Description cluster[0]:  Reads and compares last flash row to TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>DIRECT</name>
                <description>Reads and compares last flash row (direct lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Equal</name>
                    <description>Direct TESTDATA128 content and flash row read are equal</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotEqual</name>
                    <description>Direct TESTDATA128 content and flash row read are different</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LATCHED</name>
                <description>Reads and compares last flash row (latched lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Equal</name>
                    <description>Latched TESTDATA128 content and flash row read are equal</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotEqual</name>
                    <description>Latched TESTDATA128 content and flash row read are different</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTNCMPINC</name>
            <description>Description cluster[0]:  Reads and compares last flash row to complement of TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>DIRECT</name>
                <description>Reads and compares last flash row (direct lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Complement</name>
                    <description>Direct TESTDATA128 content and flash row read are each-other's complement</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotComplement</name>
                    <description>Direct TESTDATA128 content and flash row read are not each-other's complement</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LATCHED</name>
                <description>Reads and compares last flash row (latched lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Complement</name>
                    <description>Latched TESTDATA128 content and flash row read are each-other's complement</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotComplement</name>
                    <description>Latched TESTDATA128 content and flash row read are not each-other's complement</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCONTROLLINES</name>
            <description>Description cluster[0]:  Direct flash test, control lines. Refer to the flash IP test documentation for more details.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LVEN</name>
                <description>Control the LVEN signal</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>PDM25</name>
                <description>Control the PDM25 signal</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>REDEN</name>
                <description>Control the REDEN signal</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>IFREN1</name>
                <description>Control the IFREN1 signal</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>EV</name>
                <description>Control the EV signal</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>PV</name>
                <description>Control the PV signal</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>XE</name>
                <description>Control the XE signal</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>YE</name>
                <description>Control the YE signal</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>SE</name>
                <description>Control the SE signal. This signal is delayed by hardware by Tas, so that it can be written simultaneously to XE and YE</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>IFREN</name>
                <description>Control the IFREN signal</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>ERASE</name>
                <description>Control the ERASE signal</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>MAS1</name>
                <description>Control the MAS1 signal</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>PROG</name>
                <description>Control the PROG signal</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>NVSTR</name>
                <description>Control the NVSTR signal</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>TMR</name>
                <description>Control the TMR signal</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCONTROLADDR</name>
            <description>Description cluster[0]:  Direct flash test control, address lines</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>YADDR</name>
                <description>Control the YADDR signal</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>XADDR</name>
                <description>Control the XADDR signal</description>
                <lsb>5</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCOUNTERRELOAD</name>
            <description>Description cluster[0]:  Counter reload value, used when counting from SE or YE rising edge to latching of data</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RELOAD</name>
                <description>Counter reload value, in MCU bus cycles, used when counting from SE or YE rising edge to latching of data. Value of 0 has no effect (counter will not latch)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCOUNTERRUNNING</name>
            <description>Description cluster[0]:  Returns the state (counting or not) of the counter</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>RUNNING</name>
                <description>Returns the state of the counter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>Counter is not running</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>Counter is running</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTCONFIG</name>
            <description>Description cluster[0]:  Mode of operation of the counter</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Returns the state of the counter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Counter is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Counter is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>START</name>
                <description>Defines the starting point of the counter</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SE</name>
                    <description>Counter starts on SE rising edge</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>YE</name>
                    <description>Counter starts on YE rising edge</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOINC</name>
                <description>Controls the address auto-increment or -decrement</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Address is auto-incrementing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Address is auto-decrementing</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOINCEN</name>
                <description>Disables the address auto-increment or -decrement</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Address auto-incrementing/decrementing is disabled</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Address auto-incrementing/decrementing is enabled</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTTMVPPANAEN</name>
            <description>Description cluster[0]:  Controls analog signals for flash measurements</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>TMANAEN</name>
                <description>Analog enable for TM measurement. Needs to be set when measuring TM[3:0] on P0.05, P0.04, P0.01 and P0.00.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>All pads disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>All pads enabled</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPPDIVEN</name>
                <description>Enable the VPPDIV pad. Needs to be set when measuring VPPDIV on GPIO26 (P0.20), and when applying high-voltage on VPP pad.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>VPPDIV pad disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>VPPDIV pad enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>14</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-13</dimIndex>
            <name>UNUSED1[%s]</name>
            <description>Description collection[0]: Unspecified</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
