jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VMC</name>
      <description>Volatile Memory controller</description>
      <groupName>VMC</groupName>
      <baseAddress>0x40031000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>RAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAM</headerStructName>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster[0]:  RAM0 power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM 0 on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM 0 on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM 0 when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM 0 when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>Description cluster[0]:  RAM0 power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM 0 on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM 0 on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM 0 when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM 0 when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCLR</name>
            <description>Description cluster[0]:  RAM0 power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM 0 on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM 0 on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM 0 when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM 0 when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>SRAMTRIM</name>
          <description>Backdoor trim values for SRAM</description>
          <addressOffset>0xEE4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000048</resetValue>
          <fields>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RamSSNonRetTSel</name>
          <description>Timing control values for TSMC RAMs</description>
          <addressOffset>0xEE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RTSEL</name>
              <description>Read cycle timing selection</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>WTSEL</name>
              <description>Write cycle timing selection</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
